Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports interfaces the native TS imports.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports.GetUserInputs(System.Int32@,System.Int32@,System.Boolean)
Exports the get user inputs command.
pressedKey: The pressed key.
inputModifiers: The input modifiers.
fromHandle: Whether to gets the inputs for the selected handles.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports.SetHitDmHandleId(System.Int32)
Exports the set handle id command.
handleId: The id to set for the latest handle hit test.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports.ConsumeInputReceivedEvent
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.InputReceived event has been consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports.SetDeleteSelectedObjectsConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InteractionEvents.DeleteSelectedObjects event has been consumed.
requestConsumed: Indicates whether the request was consumed.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.IInteractionHandlerImports.GetScreenCoordinate(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.Internal.dotPoint_t@)
Gets the screen coordinate for the point in Zkit world.
location: The location.
point: The point.
Returns: The screen coordinate for the location in Zkit world.